{
  "data_scientist": [
    "Can you explain the difference between supervised and unsupervised learning?",
    "What is the bias-variance tradeoff?",
    "How do you handle missing data?",
    "Can you explain the purpose of regularization in machine learning?",
    "What is overfitting and how do you prevent it?",
    "Explain the difference between classification and regression.",
    "How do you deal with an imbalanced dataset?",
    "What is a confusion matrix, and how do you interpret it?",
    "Can you explain how a random forest works?",
    "What is the curse of dimensionality and how do you address it?",
    "What are the different types of machine learning algorithms?",
    "What is cross-validation and why is it important?",
    "Explain the concept of gradient descent.",
    "How do you ensure that your model generalizes well?",
    "What is the difference between L1 and L2 regularization?",
    "How do you evaluate the performance of a regression model?",
    "Can you explain the difference between ROC and PR curves?",
    "What is feature engineering, and why is it important?",
    "What is PCA and how do you use it?",
    "Can you describe a recent data science project you’ve worked on?"
  ],
  "software_engineer": [
    "What programming languages are you proficient in?",
    "Can you explain the concept of object-oriented programming?",
    "What is the difference between a stack and a queue?",
    "Explain the concept of recursion and provide an example.",
    "What is a database index, and how does it improve performance?",
    "How do you optimize a slow-performing query in SQL?",
    "Can you explain the Model-View-Controller (MVC) design pattern?",
    "What is version control, and why is it important?",
    "Can you explain the difference between a thread and a process?",
    "What are the different types of joins in SQL?",
    "Can you explain the concept of big-O notation and its importance?",
    "What is multithreading, and when would you use it?",
    "Can you explain the difference between an abstract class and an interface?",
    "What is the purpose of design patterns in software engineering?",
    "What is the difference between TCP and UDP?",
    "How do you ensure code quality and maintainability?",
    "Can you explain the concept of dependency injection?",
    "What is an algorithm, and how do you evaluate its efficiency?",
    "How do you approach debugging a complex issue in a system?",
    "Can you explain the concept of RESTful APIs?"
  ],
  "hr_interview": [
    "Tell me about yourself.",
    "Why do you want to work for our company?",
    "What are your strengths and weaknesses?",
    "Where do you see yourself in 5 years?",
    "Can you describe a challenging situation you’ve faced at work and how you handled it?",
    "Why did you leave your last job?",
    "What do you know about our company?",
    "How do you prioritize your work?",
    "What motivates you in your work?",
    "Can you describe a time when you worked in a team to achieve a goal?",
    "How do you handle stress and pressure?",
    "What are your salary expectations?",
    "What makes you a good fit for this role?",
    "What do you like to do outside of work?",
    "Can you give an example of a time when you demonstrated leadership?",
    "How do you stay organized in your work?",
    "What was the most difficult decision you made in your last job?",
    "How do you handle feedback and criticism?",
    "Can you describe a time when you had to learn a new skill quickly?",
    "Why should we hire you?"
  ],
  "Motion_Graphic_Designer": [
    "What motion graphics software are you most proficient in, and why?",
    "How do you use After Effects expressions to automate animations?",
    "Have you worked with 3D motion graphics? If so, which tools do you use (e.g., Cinema 4D, Blender)?",
    "How do you ensure smooth transitions and fluid motion in your animations?",
    "Can you explain your process for optimizing render times without losing quality?",
    "What’s your experience with motion tracking and compositing?",
    "How do you incorporate typography into motion graphics?",
    "Have you used plugins like Trapcode Suite or Element 3D? How do they enhance your workflow?",
    "How do you handle color grading and correction in motion graphics?",
    "What export settings do you typically use for different platforms (web, broadcast, social media)?",
    "Can you describe your creative process from concept to final animation?",
    "What are the key principles of motion design that you always follow?",
    "How do you maintain brand consistency in motion graphics for a company?",
    "Can you share a project where you had to blend motion graphics with live-action footage?",
    "What role does sound design play in motion graphics, and how do you integrate it?",
    "How do you handle revisions and client feedback on your animations?",
    "Have you ever worked under a tight deadline? How did you manage it?",
    "How do you collaborate with video editors, graphic designers, and other creatives on a project?",
    "Have you ever faced a technical issue in motion design that required a creative workaround? How did you solve it?",
    "How do you stay updated with the latest motion design trends and techniques?"
  ],
  "VFX_Artist": [
    "What VFX software are you proficient in?",
    "How do you approach compositing for a complex scene?",
    "Can you explain the difference between CGI, compositing, and motion tracking?",
    "How do you handle green screen keying and chroma keying challenges?",
    "Have you worked with 3D tracking? How do you ensure accuracy?",
    "What’s your experience with particle effects and simulations?",
    "Can you walk us through a VFX breakdown of one of your projects?",
    "How do you match lighting and shadows in CGI integration?",
    "What are some common VFX mistakes, and how do you avoid them?",
    "How do you optimize VFX for real-time rendering in engines like Unreal?",
    "Have you used Houdini for procedural effects? If so, what was your approach?",
    "How do you deal with high render times and optimize your workflow?",
    "What’s the most complex rotoscoping task you’ve worked on?",
    "How do you ensure seamless blending between live-action and CGI elements?",
    "Have you ever created digital doubles or character replacements?",
    "What techniques do you use for realistic explosions or smoke simulations?",
    "How do you troubleshoot issues with match-moving and camera tracking?",
    "Can you explain the role of VFX in post-production storytelling?",
    "What’s your approach to color grading and matching VFX shots?",
    "What’s a challenging VFX project you’ve worked on, and how did you solve the difficulties?"
  ],
  "Video_Editor": [
    "What editing software do you use, and why?",
    "How do you ensure smooth storytelling through editing?",
    "What’s your approach to pacing and rhythm in a video?",
    "Can you walk us through your editing workflow?",
    "How do you handle color correction and color grading?",
    "Have you worked with multi-camera editing? How do you synchronize footage?",
    "What’s your experience with green screen and keying?",
    "How do you work with different aspect ratios for various platforms?",
    "How do you handle audio editing and sound design in your projects?",
    "Can you give an example of a time when you had to work under a tight deadline?",
    "How do you manage and organize large amounts of footage?",
    "Have you worked on documentary-style editing? What’s different about it?",
    "How do you collaborate with directors and producers?",
    "What’s your approach to cutting interviews or dialogue-heavy content?",
    "Have you ever had to salvage bad footage in post-production? How did you do it?",
    "What’s your experience with motion graphics in video editing?",
    "How do you ensure consistency in visual style across a project?",
    "How do you keep up with the latest editing trends and techniques?",
    "What’s the most challenging video project you’ve worked on?",
    "How do you export and optimize videos for different platforms (YouTube, Instagram, TV, etc.)?"
  ]
}

  
